//СР6(2) У вас есть доллары. Вы хотите обменять их на рубли. Есть информация 
о стоимости купли-продажи в банках города. В городе N банков. 
Составьте программу, определяющую, какой банк выбрать, чтобы 
выгодно обменять доллары на рубли.
#include <iostream>
using namespace std;
const int BANKS = 100; // Максимальное количество банков
const int LENGTH = 50; // Максимальная длина названия банка

int main() {
    int n; // количество банков 
    char Names[BANKS][LENGTH]; // массив названий банков
    int buy[BANKS]; // массив курсов покупки 
    int sell[BANKS]; // массив курсов продажи 
    cout << "\nВведите количество банков: ";
    cin >> n;

    // Ввод информации о банках 
    for (int i = 0; i < n; ++i) {
        cout << "\nВведите название банка " << (i + 1) << ": ";
        cin >> Names[i];
        cout << "\nВведите курс покупки долларов в " << Names[i] << ": ";
        cin >> buy[i];
        cout << "\nВведите курс продажи долларов в " << Names[i] << ": ";
        cin >> sell[i];
    }

    // Определение самого выгодного банка для покупки долларов 
    int minBuy = 0; 
    for (int i = 1; i < n; ++i) {
        if (buy[i] < buy[minBuy]) {
            minBuy = i;
        }
    }

    // Определение самого выгодного банка для продажи долларов
    int maxSell = 0;
    for (int i = 1; i < n; ++i) {
        if (sell[i] > sell[maxSell]) {
            maxSell = i;
        }
    }

    // Вывод результатов 
    cout << "\nСамый выгодный банк для покупки долларов: " << Names[minBuy] << " с курсом " << buy[minBuy] << " рублей за доллар.";
    cout << "\nСамый выгодный банк для продажи долларов: " << Names[maxSell] << " с курсом " << sell[maxSell] << " рублей за доллар.";

    return 0;
}
