//СР3(2) Написать программу, которая определяет по возрасту ребенка, в какую группу в садике он попадет. От 0 до 2 лет – это ясли, от 2 до 4 лет – это младшая и от 4 до 6 лет – подгото-вительная.
#include <iostream>
#include <math.h>
using namespace std;
int main()
{
//а - возраст
    float a;
    cout << "\n Пожалуйста, введите значения";
    cout << "\na="; cin>>a;
    //определение ребенка группу
    if (a >= 0 && a <= 2)
        cout << "\n Ребенок будет в группе - ясли";
        else
    if(a >= 2 && a <= 4)
        cout << "\n Ребенок будет в группе - младшая";
        else
    if(a >= 4 && a<=6)
        cout << "\n Ребенок будет в группе - подготовительная";
        else
        cout << "\n Ребенка не берем ";
    return 0;
}